docs/docs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-06-01 Fri 17:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pragmatic automatic differentiation</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="picaud" />
<link rel="stylesheet" type="text/css" href="http://orgmode.org/worg/style/worg.css"/>

</head>
<body>
<div id="content">
<h1 class="title">Pragmatic automatic differentiation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orged9ee41">1. Introduction</a></li>
<li><a href="#orgeedf2ae">2. API documentation</a></li>
<li><a href="#org2629567">3. Internal documentation</a></li>
<li><a href="#orgc248222">4. Design remarks</a>
<ul>
<li><a href="#org273afd6">4.1. Array struct design</a>
<ul>
<li><a href="#org535bd9e">4.1.1. Multiple parameters in the struct definition</a></li>
<li><a href="#org1aee78a">4.1.2. Restricted set of constructors</a></li>
<li><a href="#orga938d41">4.1.3. Interface, main methods to redefine</a></li>
</ul>
</li>
<li><a href="#org1bdd29b">4.2. Specialization of common functions</a>
<ul>
<li><a href="#orgc164f03">4.2.1. <span class="todo TODO">TODO</span> Overloading ambiguity <code>[0/1]</code></a></li>
<li><a href="#org1b56df6">4.2.2. Code generator</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd9de592">5. Unit tests</a></li>
</ul>
</div>
</div>

<div id="outline-container-orged9ee41" class="outline-2">
<h2 id="orged9ee41"><span class="section-number-2">1</span> Introduction</h2>
</div>

<div id="outline-container-orgeedf2ae" class="outline-2">
<h2 id="orgeedf2ae"><span class="section-number-2">2</span> API documentation</h2>
<div class="outline-text-2" id="text-2">
<p>

</p>

<p>
<a id="orgc559f0d"></a> <b>Index:</b> <b>[A]</b> <a href="#orgbb0dee1">AArray</a>, <a href="#org8d35a71">AFloat</a> 
</p>
<ul class="org-ul">
<li><b><code>AArray</code></b>  <a id="orgbb0dee1"></a> <a id="org6c71667"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">AArray</span>{AT&lt;:AFloat,N,P&lt;:<span style="color: #228b22;">AbstractArray</span>,AIDX}  &lt;: <span style="color: #228b22;">AbstractArray</span>{AT,N}
</pre>
</div>
<blockquote>
<p>
This is the array type to use in place of built-in Julia <code>Array{T,N}</code> types.
</p>

<p>
<b>Parameters</b>:
</p>

<ul class="org-ul">
<li><code>AIDX</code> is an extra parameter defining how <a href="#org81c8b8b">struct AFloat</a> indices are
stored. This type can be different from <code>P</code>. For instance in case
of sparse matrix, only an uni-dimensional array to store indices
associated to non-zero components is required, no need to the
store sparsity pattern twice.</li>
</ul>

<p>
<b>Design</b>:
</p>
<ul class="org-ul">
<li><a href="#org535bd9e">Multiple parameters in the struct definition</a></li>
</ul>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/array.jl#org1fc6669">array.jl:3</a>, <a href="#orgc559f0d">back to index</a>
</p>

<div class="org-src-container">
<pre class="src src-julia"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">AArray</span>(p::<span style="color: #228b22;">Array</span>{T,N}) <span style="color: #a020f0;">where</span> {T&lt;:<span style="color: #228b22;">AbstractFloat</span>,N}
</pre>
</div>
<blockquote>
<p>
Construction from an "usual" Julia array of real numbers.
</p>

<p>
Usage example:
</p>

<div class="org-src-container">
<pre class="src src-julia">AArray(rand(2,1))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-julia">2&#215;1 PragmaticAD.AArray{PragmaticAD.AFloat{<span style="color: #228b22;">Float64</span>},2,<span style="color: #228b22;">Array</span>{<span style="color: #228b22;">Float64</span>,2},<span style="color: #228b22;">Array</span>{<span style="color: #228b22;">Int64</span>,2}}:
 PragmaticAD.AFloat{<span style="color: #228b22;">Float64</span>}(0.575999, 13)
 PragmaticAD.AFloat{<span style="color: #228b22;">Float64</span>}(0.524417, 14)
</pre>
</div>

<p>
<b>Design</b>:
</p>
<ul class="org-ul">
<li><a href="#org1aee78a">Restricted set of constructors</a></li>
</ul>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/array.jl#org213ce87">array.jl:22</a>, <a href="#orgc559f0d">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>AFloat</code></b>  <a id="org8d35a71"></a> <a id="org81c8b8b"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">AFloat</span>{T&lt;:<span style="color: #228b22;">AbstractFloat</span>} &lt;: <span style="color: #228b22;">Real</span>
</pre>
</div>
<blockquote>
<p>
Specialization of number alllowing to track and record operations in the <span class="underline">struct Tape</span>
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/tape.jl#org7a5a460">tape.jl:35</a>, <a href="#orgc559f0d">back to index</a>
</p>
</div>
</div>
