docs/docs.org
* Internal documentation

  #+BEGIN_SRC julia :results output drawer :eval no-export :exports results
documented_items=create_documented_item_array_dir("~/GitHub/PragmaticAD.jl/src/");
print_org_doc(documented_items,link_prefix="All_", header_level=0)
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  # =WARNING:= cannot interpret /home/picaud/GitHub/PragmaticAD.jl/src/array.jl:3 AssertionError("code != nothing")
  # =WARNING:= cannot interpret /home/picaud/GitHub/PragmaticAD.jl/src/array.jl:135 AssertionError("code != nothing")
  # =WARNING:= cannot interpret /home/picaud/GitHub/PragmaticAD.jl/src/array.jl:143 AssertionError("code != nothing")
  # =WARNING:= cannot interpret /home/picaud/GitHub/PragmaticAD.jl/src/array.jl:156 AssertionError("code != nothing")
  <<Gkld0Zk4>> *Index:* *[A]* [[tX42c0XO][AArray]], [[vxX8Fn3D][AFloat]] *[B]* [[31fHC981][Base.push!]], [[EOp02P07][Base.show]] *[I]* [[AwASL4Ms][IndexStyle]] *[T]* [[ublwSrkt][Tape]] *[a]* [[ceo4adIV][afloat_count]], [[zyDzUVMQ][afloat_next_index]], [[oGw03ufF][aidx]], [[sLUcfW1T][aidx_type]] *[c]* [[Ei4XL21M][create_tape_chunk]], [[anzfs1Pq][create_tape_record]] *[e]* [[LiraDiSX][export]] *[f]* [[YxuF8Doy][f_gradient]] *[g]* [[O8FGvPa2][getindex]] *[i]* [[xgEpSxC8][increase_size!]] *[p]* [[yszQKaJj][parent]], [[M46lwP8M][parent_type]] *[r]* [[7knU3NbM][rewind_tape!]] *[s]* [[JTkZhO71][size]] *[t]* [[d50C4xO4][tape_position]] *[∂]* [[32EfSl0Z][∂_j]] 
  - @@latex:\phantomsection@@ *=AArray=*  <<tX42c0XO>> <<All_AArray>>
  #+BEGIN_SRC julia :eval never :exports code
  struct AArray{AT<:AFloat,N,P<:AbstractArray,AIDX}  <: AbstractArray{AT,N}
  #+END_SRC
  #+BEGIN_QUOTE
  This is the array type to use in place of built-in Julia =Array{T,N}= types.

  *Parameters*:

  - =AIDX= is an extra parameter defining how [[All_AFloat][struct AFloat]] indices are
    stored. This type can be different from =P=. For instance in case
    of sparse matrix, only an uni-dimensional array to store indices
    associated to non-zero components is required, no need to the
    store sparsity pattern twice. 

  *Design*:
  - [[id:c39435d9-532c-4390-8089-bde4c5e53f3e][Multiple parameters in the struct definition]]

  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/array.jl::6][array.jl:6]], [[Gkld0Zk4][back to index]]

  #+BEGIN_SRC julia :eval never :exports code
  function AArray(p::Array{T,N}) where {T<:AbstractFloat,N}
  #+END_SRC
  #+BEGIN_QUOTE
  Construction from an "usual" Julia array of real numbers.

  Usage example:

  #+BEGIN_SRC julia
  AArray(rand(2))
  AArray(rand(2,3))
  #+END_SRC
  #+BEGIN_SRC julia
  2-element PragmaticAD.AArray{PragmaticAD.AFloat{Float64},1,Array{Float64,1},Array{Int64,1}}:
   0.3973_45  
   0.437492_46
  2×3 PragmaticAD.AArray{PragmaticAD.AFloat{Float64},2,Array{Float64,2},Array{Int64,2}}:
   0.532624_47  0.585252_49  0.933764_51  
   0.166291_48  0.439554_50  0.00963996_52
  #+END_SRC

  *Design*:
  - [[id:b384f347-8c27-42ae-9759-2914d67cad4d][Restricted set of constructors]]
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/array.jl::25][array.jl:25]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=AFloat=*  <<vxX8Fn3D>> <<All_AFloat>>
  #+BEGIN_SRC julia :eval never :exports code
  struct AFloat{T<:AbstractFloat} <: Number
  #+END_SRC
  #+BEGIN_QUOTE
  Specialization of number alllowing to track and record operations in the [[All_Tape][struct Tape]]

  - TODO [ ] support complex numbers (use [[https://en.wikipedia.org/wiki/Wirtinger_derivatives][Wirtinger_derivatives]]).
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/tape.jl::40][tape.jl:40]], [[Gkld0Zk4][back to index]]

  #+BEGIN_SRC julia :eval never :exports code
  AFloat{T}(value::S) where {T<:AbstractFloat,S<:Real}
  #+END_SRC
  #+BEGIN_QUOTE
  Creates a new [[All_AFloat][struct AFloat]] from its value.
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/tape.jl::50][tape.jl:50]], [[Gkld0Zk4][back to index]]

  #+BEGIN_SRC julia :eval never :exports code
  AFloat(value::T) where {T<:AbstractFloat}
  #+END_SRC
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/tape.jl::55][tape.jl:55]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=Base.push!=*  <<31fHC981>>
  #+BEGIN_SRC julia :eval never :exports code
  function Base.push!{T,N}(v::Array{T,1},x::NTuple{N,T})::Array{T,1}
  #+END_SRC
  #+BEGIN_QUOTE
  A helper function that push a NTuple into an array
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/tape.jl::87][tape.jl:87]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=Base.show=*  <<EOp02P07>>
  #+BEGIN_SRC julia :eval never :exports code
  Base.show(io::IO, x::AFloat)
  #+END_SRC
  #+BEGIN_QUOTE
  Defines pretty print as explained [[https://docs.julialang.org/en/latest/manual/types/#man-custom-pretty-printing-1][in the official doc]].
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/tape.jl::58][tape.jl:58]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=IndexStyle=*  <<AwASL4Ms>>
  #+BEGIN_SRC julia :eval never :exports code
  IndexStyle(::Type{<:AArray{AT,N,P,AIDX}}) where {AT,N,P,AIDX}
  #+END_SRC
  #+BEGIN_QUOTE
  *Design*:
  - [[id:1b16ffef-47fa-473c-b033-de4a864dcaf3][Interface, main methods to redefine]]
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/array.jl::120][array.jl:120]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=Tape=*  <<ublwSrkt>> <<All_Tape>>
  #+BEGIN_SRC julia :eval never :exports code
  mutable struct Tape{T<:AbstractFloat}
  #+END_SRC
  #+BEGIN_QUOTE
  Used to store $d\Phi^{(m)}$ using a storage scheme close to the
  Compressed Row Storage (CRS)

  *Note:* we use =mutable= to have a "by reference" semantic to avoid
   having a tape copy (which would be catastrophic).
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/tape.jl::13][tape.jl:13]], [[Gkld0Zk4][back to index]]

  #+BEGIN_SRC julia :eval never :exports code
  function Tape{T<:AbstractFloat}(::Type{T},tape_initial_size::Int = 100)
  #+END_SRC
  #+BEGIN_QUOTE
  Tape constructor
  #+BEGIN_SRC julia
  PragmaticAD.Tape(Float64)
  #+END_SRC
  #+BEGIN_SRC julia
  PragmaticAD.Tape{Float64}([1], PragmaticAD.∂_j{Float64}[])
  #+END_SRC
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/tape.jl::26][tape.jl:26]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=afloat_count=*  <<ceo4adIV>>
  #+BEGIN_SRC julia :eval never :exports code
  afloat_count{T}(tape::Tape{T})::Int
  #+END_SRC
  #+BEGIN_QUOTE
  Returns how many [[All_AFloat][struct AFloat]] are stored in the current [[All_Tape][struct Tape]]
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/tape.jl::81][tape.jl:81]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=afloat_next_index=*  <<zyDzUVMQ>>
  #+BEGIN_SRC julia :eval never :exports code
  afloat_next_index{T}(tape::Tape{T})::Int
  #+END_SRC
  #+BEGIN_QUOTE
  Returns a new [[All_AFloat][struct AFloat]] index. Generally used at creation time,
  see [[All_create_tape_record_value][create_tape_record(...)]]
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/tape.jl::74][tape.jl:74]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=aidx=*  <<oGw03ufF>>
  #+BEGIN_SRC julia :eval never :exports code
  aidx(aa::AArray)
  #+END_SRC
  #+BEGIN_QUOTE
  The recommended way to access aidx member

  See [[id:c39435d9-532c-4390-8089-bde4c5e53f3e][Multiple parameters in the struct definition]]
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/array.jl::86][array.jl:86]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=aidx_type=*  <<sLUcfW1T>>
  #+BEGIN_SRC julia :eval never :exports code
  aidx_type(::Type{AArray{AT,N,P,AIDX}}) where {AT,N,P,AIDX}
  #+END_SRC
  #+BEGIN_QUOTE
  The recommended way to access aidx member *type*

  See [[id:c39435d9-532c-4390-8089-bde4c5e53f3e][Multiple parameters in the struct definition]]
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/array.jl::78][array.jl:78]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=create_tape_chunk=*  <<Ei4XL21M>>
  #+BEGIN_SRC julia :eval never :exports code
  function create_tape_chunk(tape::Tape{T},chunk_n::Int) where {T}
  #+END_SRC
  #+BEGIN_QUOTE
  This function allocate a chunk of =chunk_n= new [[All_AFloat][struct AFloat]].
  It returns the index of the first one.
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/array.jl::58][array.jl:58]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=create_tape_record=*  <<anzfs1Pq>>
  #+BEGIN_SRC julia :eval never :exports code
  function create_tape_record{T,N}(tape::Tape{T},value::T,dϕ::NTuple{N,∂_j{T}})::AFloat{T}
  #+END_SRC
  #+BEGIN_QUOTE
  Creates a new differential $d\phi = \sum \partial_j \phi d x_j$ and
  returns the associated [[All_AFloat][struct AFloat]].
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/tape.jl::100][tape.jl:100]], [[Gkld0Zk4][back to index]]
   @@latex:\phantomsection@@  <<All_create_tape_record_value>>
  #+BEGIN_SRC julia :eval never :exports code
  function create_tape_record{T}(tape::Tape{T},value::T)::AFloat{T}
  #+END_SRC
  #+BEGIN_QUOTE
  Creates a new [[All_AFloat][struct AFloat]]
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/tape.jl::113][tape.jl:113]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=export=*  <<LiraDiSX>>
  #+BEGIN_SRC julia :eval never :exports code
  export AFloat, afloat_count
  #+END_SRC
  #+BEGIN_QUOTE
  Exported symbols
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/tape.jl::1][tape.jl:1]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=f_gradient=*  <<YxuF8Doy>>
  #+BEGIN_SRC julia :eval never :exports code
  function f_gradient{T}(tape::Tape{T},
			 index::Int,
			 stop_at_tape_position::Int)
  #+END_SRC
  #+BEGIN_QUOTE
  Computes differential adjoint vector action (reverse mode)
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/tape.jl::169][tape.jl:169]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=getindex=*  <<O8FGvPa2>>
  #+BEGIN_SRC julia :eval never :exports code
  getindex(aa::AArray{AT}, i::Int) where {AT}
  #+END_SRC
  #+BEGIN_QUOTE
  *Design*:
  - [[id:1b16ffef-47fa-473c-b033-de4a864dcaf3][Interface, main methods to redefine]]
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/array.jl::127][array.jl:127]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=increase_size!=*  <<xgEpSxC8>>
  #+BEGIN_SRC julia :eval never :exports code
  function increase_size!(v::Array{T,1},positive_integer::Int)::Int where {T}
  #+END_SRC
  #+BEGIN_QUOTE
  This function increase array size by =positive_integer= and returns
  the initial size
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/array.jl::47][array.jl:47]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=parent=*  <<yszQKaJj>>
  #+BEGIN_SRC julia :eval never :exports code
  parent(aa::AArray)
  #+END_SRC
  #+BEGIN_QUOTE
  The recommended way to access parent membe

  See [[id:c39435d9-532c-4390-8089-bde4c5e53f3e][Multiple parameters in the struct definition]]
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/array.jl::102][array.jl:102]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=parent_type=*  <<M46lwP8M>>
  #+BEGIN_SRC julia :eval never :exports code
  parent_type(::Type{AArray{AT,N,P,AIDX}}) where {AT,N,P,AIDX}
  #+END_SRC
  #+BEGIN_QUOTE
  The recommended way to access parent member *type*

  See [[id:c39435d9-532c-4390-8089-bde4c5e53f3e][Multiple parameters in the struct definition]]
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/array.jl::94][array.jl:94]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=rewind_tape!=*  <<7knU3NbM>> <<All_rewind_tape>>
  #+BEGIN_SRC julia :eval never :exports code
  function rewind_tape!{T}(tape::Tape{T},tape_position::Int)
  #+END_SRC
  #+BEGIN_QUOTE
  Rewinds tape

  See: [[All_tape_position][tape_position(...)]]
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/tape.jl::138][tape.jl:138]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=size=*  <<JTkZhO71>>
  #+BEGIN_SRC julia :eval never :exports code
  size(aa::AArray)
  #+END_SRC
  #+BEGIN_QUOTE
  *Design*:
  - [[id:1b16ffef-47fa-473c-b033-de4a864dcaf3][Interface, main methods to redefine]]
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/array.jl::113][array.jl:113]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=tape_position=*  <<d50C4xO4>> <<All_tape_position>>
  #+BEGIN_SRC julia :eval never :exports code
  tape_position{T}(tape::Tape{T})
  #+END_SRC
  #+BEGIN_QUOTE
  Returns tape position.

  Usage example:

  #+BEGIN_SRC julia :eval never
  tape=PragmaticAD.get_tape(Float64)
  tpos=PragmaticAD.tape_position(tape)
  # some computations
  rewind_tape!(tape,tpos)
  #+END_SRC

  See: [[All_rewind_tape][rewind_tape!(...)]]
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/tape.jl::122][tape.jl:122]], [[Gkld0Zk4][back to index]]
  - @@latex:\phantomsection@@ *=∂_j=*  <<32EfSl0Z>>
  #+BEGIN_SRC julia :eval never :exports code
  struct ∂_j{T<:Real}
  #+END_SRC
  #+BEGIN_QUOTE
  Used to store partial derivatives $\partial_j$
  #+END_QUOTE
  [[file:/home/picaud/GitHub/PragmaticAD.jl/src/tape.jl::6][tape.jl:6]], [[Gkld0Zk4][back to index]]
  :END:

