docs/docs.html

<div id="outline-container-org2629567" class="outline-2">
<h2 id="org2629567"><span class="section-number-2">3</span> Internal documentation</h2>
<div class="outline-text-2" id="text-3">
<p>
<a id="orgd2a3f3e"></a> <b>Index:</b> <b>[A]</b> <a href="#org7fafb81">AArray</a>, <a href="#org882408a">AFloat</a> <b>[B]</b> <a href="#orge3a20ff">Base.push!</a>, <a href="#org6d0bda6">Base.show</a> <b>[I]</b> <a href="#org14dca7d">IndexStyle</a> <b>[T]</b> <a href="#org3a506a9">Tape</a> <b>[a]</b> <a href="#orgc58de02">afloat_count</a>, <a href="#org3e3b7c4">afloat_next_index</a>, <a href="#org18218ad">aidx</a>, <a href="#orgc948971">aidx_type</a> <b>[c]</b> <a href="#orgf4e762b">create_tape_chunk</a>, <a href="#org9d68c3b">create_tape_record</a> <b>[e]</b> <a href="#org4c6af0d">export</a> <b>[f]</b> <a href="#orge4600d2">f_gradient</a> <b>[g]</b> <a href="#org65b7610">getindex</a> <b>[i]</b> <a href="#org4b39500">increase_size!</a> <b>[p]</b> <a href="#org23f7f82">parent</a>, <a href="#org922da1b">parent_type</a> <b>[r]</b> <a href="#org1279450">rewind_tape!</a> <b>[s]</b> <a href="#org4ddfb47">size</a> <b>[t]</b> <a href="#orga039d38">tape_position</a> <b>[∂]</b> <a href="#org3ac03e6">∂_j</a> 
</p>
<ul class="org-ul">
<li><b><code>AArray</code></b>  <a id="org7fafb81"></a> <a id="orgdd4989f"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">AArray</span>{AT&lt;:AFloat,N,P&lt;:<span style="color: #228b22;">AbstractArray</span>,AIDX}  &lt;: <span style="color: #228b22;">AbstractArray</span>{AT,N}
</pre>
</div>
<blockquote>
<p>
This is the array type to use in place of built-in Julia <code>Array{T,N}</code> types.
</p>

<p>
<b>Parameters</b>:
</p>

<ul class="org-ul">
<li><code>AIDX</code> is an extra parameter defining how <a href="#org7940e9e">struct AFloat</a> indices are
stored. This type can be different from <code>P</code>. For instance in case
of sparse matrix, only an uni-dimensional array to store indices
associated to non-zero components is required, no need to the
store sparsity pattern twice.</li>
</ul>

<p>
<b>Design</b>:
</p>
<ul class="org-ul">
<li><a href="#org535bd9e">Multiple parameters in the struct definition</a></li>
</ul>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/array.jl#org11f3a1a">array.jl:6</a>, <a href="#orgd2a3f3e">back to index</a>
</p>

<div class="org-src-container">
<pre class="src src-julia">  <span style="color: #a020f0;">function</span> <span style="color: #0000ff;">AArray</span>(p::<span style="color: #228b22;">Array</span>{T,N}) <span style="color: #a020f0;">where</span> {T&lt;:<span style="color: #228b22;">AbstractFloat</span>,N}
</pre>
</div>
<blockquote>
<p>
Construction from an "usual" Julia array of real numbers.
</p>

<p>
Usage example:
</p>

<div class="org-src-container">
<pre class="src src-julia">  AArray(rand(2))
  AArray(rand(2,3))
</pre>
</div>
<div class="org-src-container">
<pre class="src src-julia">  2-element PragmaticAD.AArray{PragmaticAD.AFloat{<span style="color: #228b22;">Float64</span>},1,<span style="color: #228b22;">Array</span>{<span style="color: #228b22;">Float64</span>,1},<span style="color: #228b22;">Array</span>{<span style="color: #228b22;">Int64</span>,1}}:
   0.3973_45  
   0.437492_46
  2&#215;3 PragmaticAD.AArray{PragmaticAD.AFloat{<span style="color: #228b22;">Float64</span>},2,<span style="color: #228b22;">Array</span>{<span style="color: #228b22;">Float64</span>,2},<span style="color: #228b22;">Array</span>{<span style="color: #228b22;">Int64</span>,2}}:
   0.532624_47  0.585252_49  0.933764_51  
   0.166291_48  0.439554_50  0.00963996_52
</pre>
</div>

<p>
<b>Design</b>:
</p>
<ul class="org-ul">
<li><a href="#org1aee78a">Restricted set of constructors</a></li>
</ul>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/array.jl#orgb30e8bb">array.jl:25</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>AFloat</code></b>  <a id="org882408a"></a> <a id="org7940e9e"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">AFloat</span>{T&lt;:<span style="color: #228b22;">AbstractFloat</span>} &lt;: <span style="color: #228b22;">Number</span>
</pre>
</div>
<blockquote>
<p>
Specialization of number alllowing to track and record operations in the <a href="#org363f68b">struct Tape</a>
</p>

<ul class="org-ul">
<li>TODO [ ] support complex numbers (use <a href="https://en.wikipedia.org/wiki/Wirtinger_derivatives">Wirtinger_derivatives</a>).</li>
</ul>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/tape.jl#org76ef051">tape.jl:40</a>, <a href="#orgd2a3f3e">back to index</a>
</p>

<div class="org-src-container">
<pre class="src src-julia">  AFloat{T}(value::<span style="color: #228b22;">S</span>) <span style="color: #a020f0;">where</span> {T&lt;:<span style="color: #228b22;">AbstractFloat</span>,S&lt;:<span style="color: #228b22;">Real</span>}
</pre>
</div>
<blockquote>
<p>
Creates a new <a href="#org7940e9e">struct AFloat</a> from its value.
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/tape.jl#org57c870d">tape.jl:50</a>, <a href="#orgd2a3f3e">back to index</a>
</p>

<div class="org-src-container">
<pre class="src src-julia">  AFloat(value::<span style="color: #228b22;">T</span>) <span style="color: #a020f0;">where</span> {T&lt;:<span style="color: #228b22;">AbstractFloat</span>}
</pre>
</div>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/tape.jl#org1559f68">tape.jl:55</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>Base.push!</code></b>  <a id="orge3a20ff"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  <span style="color: #a020f0;">function</span> Base.<span style="color: #0000ff;">push!</span>{T,N}(v::<span style="color: #228b22;">Array</span>{T,1},x::<span style="color: #228b22;">NTuple</span>{N,T})::<span style="color: #228b22;">Array</span>{T,1}
</pre>
</div>
<blockquote>
<p>
A helper function that push a NTuple into an array
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/tape.jl#org990cd6c">tape.jl:87</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>Base.show</code></b>  <a id="org6d0bda6"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  Base.show(io::<span style="color: #228b22;">IO</span>, x::<span style="color: #228b22;">AFloat</span>)
</pre>
</div>
<blockquote>
<p>
Defines pretty print as explained <a href="https://docs.julialang.org/en/latest/manual/types/#man-custom-pretty-printing-1">in the official doc</a>.
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/tape.jl#org10a9221">tape.jl:58</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>IndexStyle</code></b>  <a id="org14dca7d"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  IndexStyle(::<span style="color: #228b22;">Type</span>{&lt;:<span style="color: #228b22;">AArray</span>{AT,N,P,AIDX}}) <span style="color: #a020f0;">where</span> {AT,N,P,AIDX}
</pre>
</div>
<blockquote>
<p>
<b>Design</b>:
</p>
<ul class="org-ul">
<li><a href="#orga938d41">Interface, main methods to redefine</a></li>
</ul>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/array.jl#orgdd65c60">array.jl:120</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>Tape</code></b>  <a id="org3a506a9"></a> <a id="org363f68b"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  <span style="color: #a020f0;">mutable struct</span> <span style="color: #228b22;">Tape</span>{T&lt;:<span style="color: #228b22;">AbstractFloat</span>}
</pre>
</div>
<blockquote>
<p>
Used to store \(d\Phi^{(m)}\) using a storage scheme close to the
Compressed Row Storage (CRS)
</p>

<p>
<b>Note:</b> we use <code>mutable</code> to have a "by reference" semantic to avoid
 having a tape copy (which would be catastrophic).
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/tape.jl#org78728c4">tape.jl:13</a>, <a href="#orgd2a3f3e">back to index</a>
</p>

<div class="org-src-container">
<pre class="src src-julia">  <span style="color: #a020f0;">function</span> <span style="color: #0000ff;">Tape</span>{T&lt;:<span style="color: #228b22;">AbstractFloat</span>}(::<span style="color: #228b22;">Type</span>{T},tape_initial_size::<span style="color: #228b22;">Int</span> = 100)
</pre>
</div>
<blockquote>
<p>
Tape constructor
</p>
<div class="org-src-container">
<pre class="src src-julia">  PragmaticAD.Tape(<span style="color: #228b22;">Float64</span>)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-julia">  PragmaticAD.Tape{<span style="color: #228b22;">Float64</span>}([1], PragmaticAD.&#8706;_j{<span style="color: #228b22;">Float64</span>}[])
</pre>
</div>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/tape.jl#org125cef7">tape.jl:26</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>afloat_count</code></b>  <a id="orgc58de02"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  afloat_count{T}(tape::<span style="color: #228b22;">Tape</span>{T})::<span style="color: #228b22;">Int</span>
</pre>
</div>
<blockquote>
<p>
Returns how many <a href="#org7940e9e">struct AFloat</a> are stored in the current <a href="#org363f68b">struct Tape</a>
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/tape.jl#org666a075">tape.jl:81</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>afloat_next_index</code></b>  <a id="org3e3b7c4"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  afloat_next_index{T}(tape::<span style="color: #228b22;">Tape</span>{T})::<span style="color: #228b22;">Int</span>
</pre>
</div>
<blockquote>
<p>
Returns a new <a href="#org7940e9e">struct AFloat</a> index. Generally used at creation time,
see <a href="#org008dbb6">create_tape_record(&#x2026;)</a>
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/tape.jl#orgb9910f2">tape.jl:74</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>aidx</code></b>  <a id="org18218ad"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  aidx(aa::<span style="color: #228b22;">AArray</span>)
</pre>
</div>
<blockquote>
<p>
The recommended way to access aidx member
</p>

<p>
See <a href="#org535bd9e">Multiple parameters in the struct definition</a>
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/array.jl#orgaef4c3a">array.jl:86</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>aidx_type</code></b>  <a id="orgc948971"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  aidx_type(::<span style="color: #228b22;">Type</span>{AArray{AT,N,P,AIDX}}) <span style="color: #a020f0;">where</span> {AT,N,P,AIDX}
</pre>
</div>
<blockquote>
<p>
The recommended way to access aidx member <b>type</b>
</p>

<p>
See <a href="#org535bd9e">Multiple parameters in the struct definition</a>
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/array.jl#orgc689931">array.jl:78</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>create_tape_chunk</code></b>  <a id="orgf4e762b"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  <span style="color: #a020f0;">function</span> <span style="color: #0000ff;">create_tape_chunk</span>(tape::<span style="color: #228b22;">Tape</span>{T},chunk_n::<span style="color: #228b22;">Int</span>) <span style="color: #a020f0;">where</span> {T}
</pre>
</div>
<blockquote>
<p>
This function allocate a chunk of <code>chunk_n</code> new <a href="#org7940e9e">struct AFloat</a>.
It returns the index of the first one.
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/array.jl#org1b24477">array.jl:58</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>create_tape_record</code></b>  <a id="org9d68c3b"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  <span style="color: #a020f0;">function</span> <span style="color: #0000ff;">create_tape_record</span>{T,N}(tape::<span style="color: #228b22;">Tape</span>{T},value::<span style="color: #228b22;">T</span>,d&#981;::<span style="color: #228b22;">NTuple</span>{N,&#8706;_j{T}})::<span style="color: #228b22;">AFloat</span>{T}
</pre>
</div>
<blockquote>
<p>
Creates a new differential \(d\phi = \sum \partial_j \phi d x_j\) and
returns the associated <a href="#org7940e9e">struct AFloat</a>.
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/tape.jl#org19a095a">tape.jl:100</a>, <a href="#orgd2a3f3e">back to index</a>
   <a id="org008dbb6"></a>
</p>
<div class="org-src-container">
<pre class="src src-julia">  <span style="color: #a020f0;">function</span> <span style="color: #0000ff;">create_tape_record</span>{T}(tape::<span style="color: #228b22;">Tape</span>{T},value::<span style="color: #228b22;">T</span>)::<span style="color: #228b22;">AFloat</span>{T}
</pre>
</div>
<blockquote>
<p>
Creates a new <a href="#org7940e9e">struct AFloat</a>
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/tape.jl#org91299fc">tape.jl:113</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>export</code></b>  <a id="org4c6af0d"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  <span style="color: #a020f0;">export</span> AFloat, afloat_count
</pre>
</div>
<blockquote>
<p>
Exported symbols
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/tape.jl#orgebf1404">tape.jl:1</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>f_gradient</code></b>  <a id="orge4600d2"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  <span style="color: #a020f0;">function</span> <span style="color: #0000ff;">f_gradient</span>{T}(tape::<span style="color: #228b22;">Tape</span>{T},
                         index::<span style="color: #228b22;">Int</span>,
                         stop_at_tape_position::<span style="color: #228b22;">Int</span>)
</pre>
</div>
<blockquote>
<p>
Computes differential adjoint vector action (reverse mode)
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/tape.jl#org87266ea">tape.jl:169</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>getindex</code></b>  <a id="org65b7610"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  getindex(aa::<span style="color: #228b22;">AArray</span>{AT}, i::<span style="color: #228b22;">Int</span>) <span style="color: #a020f0;">where</span> {AT}
</pre>
</div>
<blockquote>
<p>
<b>Design</b>:
</p>
<ul class="org-ul">
<li><a href="#orga938d41">Interface, main methods to redefine</a></li>
</ul>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/array.jl#orgdcb9234">array.jl:127</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>increase_size!</code></b>  <a id="org4b39500"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  <span style="color: #a020f0;">function</span> <span style="color: #0000ff;">increase_size!</span>(v::<span style="color: #228b22;">Array</span>{T,1},positive_integer::<span style="color: #228b22;">Int</span>)::<span style="color: #228b22;">Int</span> <span style="color: #a020f0;">where</span> {T}
</pre>
</div>
<blockquote>
<p>
This function increase array size by <code>positive_integer</code> and returns
the initial size
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/array.jl#org6d5623f">array.jl:47</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>parent</code></b>  <a id="org23f7f82"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  parent(aa::<span style="color: #228b22;">AArray</span>)
</pre>
</div>
<blockquote>
<p>
The recommended way to access parent membe
</p>

<p>
See <a href="#org535bd9e">Multiple parameters in the struct definition</a>
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/array.jl#orgf5271ff">array.jl:102</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>parent_type</code></b>  <a id="org922da1b"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  parent_type(::<span style="color: #228b22;">Type</span>{AArray{AT,N,P,AIDX}}) <span style="color: #a020f0;">where</span> {AT,N,P,AIDX}
</pre>
</div>
<blockquote>
<p>
The recommended way to access parent member <b>type</b>
</p>

<p>
See <a href="#org535bd9e">Multiple parameters in the struct definition</a>
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/array.jl#orgc897033">array.jl:94</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>rewind_tape!</code></b>  <a id="org1279450"></a> <a id="org6f3e041"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  <span style="color: #a020f0;">function</span> <span style="color: #0000ff;">rewind_tape!</span>{T}(tape::<span style="color: #228b22;">Tape</span>{T},tape_position::<span style="color: #228b22;">Int</span>)
</pre>
</div>
<blockquote>
<p>
Rewinds tape
</p>

<p>
See: <a href="#org4fab90c">tape_position(&#x2026;)</a>
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/tape.jl#orgc2f0d7f">tape.jl:138</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>size</code></b>  <a id="org4ddfb47"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  size(aa::<span style="color: #228b22;">AArray</span>)
</pre>
</div>
<blockquote>
<p>
<b>Design</b>:
</p>
<ul class="org-ul">
<li><a href="#orga938d41">Interface, main methods to redefine</a></li>
</ul>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/array.jl#orgf6a1d53">array.jl:113</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>tape_position</code></b>  <a id="orga039d38"></a> <a id="org4fab90c"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  tape_position{T}(tape::<span style="color: #228b22;">Tape</span>{T})
</pre>
</div>
<blockquote>
<p>
Returns tape position.
</p>

<p>
Usage example:
</p>

<div class="org-src-container">
<pre class="src src-julia">  tape=PragmaticAD.get_tape(<span style="color: #228b22;">Float64</span>)
  tpos=PragmaticAD.tape_position(tape)
  <span style="color: #b22222;"># </span><span style="color: #b22222;">some computations</span>
  rewind_tape!(tape,tpos)
</pre>
</div>

<p>
See: <a href="#org6f3e041">rewind_tape!(&#x2026;)</a>
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/tape.jl#orge2ed039">tape.jl:122</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>∂_j</code></b>  <a id="org3ac03e6"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">  <span style="color: #a020f0;">struct</span> &#8706;_j{T&lt;:<span style="color: #228b22;">Real</span>}
</pre>
</div>
<blockquote>
<p>
Used to store partial derivatives \(\partial_j\)
</p>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/PragmaticAD.jl/src/tape.jl#org30cc093">tape.jl:6</a>, <a href="#orgd2a3f3e">back to index</a>
</p>
</div>
</div>
