docs/docs.html

<div id="outline-container-orgc248222" class="outline-2">
<h2 id="orgc248222"><span class="section-number-2">4</span> Design remarks</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org273afd6" class="outline-3">
<h3 id="org273afd6"><span class="section-number-3">4.1</span> Array struct design</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The global design has been inspired from these Julia packages:
</p>
<ul class="org-ul">
<li><a href="https://github.com/JuliaArrays/OffsetArrays.jl/blob/master/src/OffsetArrays.jl">OffsetArrays.jl</a></li>
<li><a href="https://github.com/JuliaArrays/StaticArrays.jl">StaticArrays.jl</a></li>
</ul>
</div>

<div id="outline-container-org535bd9e" class="outline-4">
<h4 id="org535bd9e"><a id="ID-c39435d9-532c-4390-8089-bde4c5e53f3e"></a><span class="section-number-4">4.1.1</span> Multiple parameters in the struct definition</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
The <a href="#orgdd4989f">AArray</a> class can possibly have a quite large number of parameters
(here <code>T,N,AIDX,O</code>). In order to decouple this parametrization from
the future method implementations we use the following guideline.
</p>

<p>
Define <code>foo</code> as follows:
</p>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #0000ff;">foo</span>(aa:AArray) = ...
</pre>
</div>
<p>
and not as follows:
</p>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #0000ff;">foo</span>(aa::<span style="color: #228b22;">AArray</span>{T,N,P,AIDX}) <span style="color: #a020f0;">where</span> {T,N,P,AIDX} = ...
</pre>
</div>
<p>
In this former code we see that any change in the parameter lists will break <code>foo</code> function code.
</p>

<p>
As a consequence, one must define a <b>restricted number</b> of helper
functions like
</p>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #0000ff;">aidx_type</span>(::<span style="color: #228b22;">Type</span>{AArray{T,N,P,AIDX}}) <span style="color: #a020f0;">where</span> {T,N,P,AIDX} = AIDX
... same <span style="color: #a020f0;">for</span> T,N,P and that is all!
</pre>
</div>
</div>
</div>

<div id="outline-container-org1aee78a" class="outline-4">
<h4 id="org1aee78a"><a id="ID-b384f347-8c27-42ae-9759-2914d67cad4d"></a><span class="section-number-4">4.1.2</span> Restricted set of constructors</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
There are a lot of Array types in Julia 
</p>
<pre class="example">
julia&gt; subtypes(AbstractArray)
24-element Array{Union{DataType, UnionAll},1}:
 AbstractSparseArray                      
 Bidiagonal                               
 ConjArray                                
 Core.Inference.Range                     
 DenseArray                               
 ...
</pre>
<p>
with some variations that can lead to unexpected bugs if we blindly use a generic approach.
In order to control type variability we use an inner constructor. From Julia doc:
</p>
<blockquote>
<p>
Without any explicitly provided inner constructors, the declaration of
the composite type Point{T&lt;:Real} automatically provides an inner
constructor, Point{T}, for each possible type T&lt;:Real, that behaves
just like non-parametric default inner constructors do. It also
provides a single general outer Point constructor that takes pairs of
real arguments, which must be of the same type.
</p>
</blockquote>

<p>
This mechanism allows use to explicitly control available implementations:
</p>

<div class="org-src-container">
<pre class="src src-julia">julia&gt; <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">X</span>{T}
           x::<span style="color: #228b22;">T</span>

           <span style="color: #0000ff;">X</span>(n::<span style="color: #228b22;">I</span>) <span style="color: #a020f0;">where</span> {I&lt;:<span style="color: #228b22;">Integer</span>} = new{I}(n)
       <span style="color: #a020f0;">end</span>

julia&gt; X(5)
X{<span style="color: #228b22;">Int64</span>}(5)

julia&gt; X(5.0)
ERROR: MethodError: Cannot <span style="color: #8b2252;">`convert`</span> an object of <span style="color: #a020f0;">type</span> <span style="color: #228b22;">Float64</span> to an object of <span style="color: #a020f0;">type</span> <span style="color: #228b22;">X</span>
This may have arisen from a call to the constructor X(...),
since <span style="color: #a020f0;">type</span> <span style="color: #228b22;">constructors</span> fall back to convert methods.
Stacktrace:
 [1] X(::<span style="color: #228b22;">Float64</span>) at ./sysimg.jl:77
</pre>
</div>
</div>
</div>

<div id="outline-container-orga938d41" class="outline-4">
<h4 id="orga938d41"><a id="ID-1b16ffef-47fa-473c-b033-de4a864dcaf3"></a><span class="section-number-4">4.1.3</span> Interface, main methods to redefine</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
Methods to implement can be found <a href="https://docs.julialang.org/en/stable/manual/interfaces/#man-interface-array-1">here</a> (official julia doc)
</p>

<p>
The idea is to reuse as much a possible <code>parent</code>'s methods.
</p>
</div>

<ol class="org-ol">
<li><a id="org08f8060"></a><a id="ID-ffb7408e-cb7b-4c7e-a1f8-39c3af3d37d5"></a>Remark<br />
<div class="outline-text-5" id="text-4-1-3-1">
<p>
CAVEAT: my first attempt was to write <code>getindex(parent(aa),I)</code> as follows:
</p>

<div class="org-src-container">
<pre class="src src-julia">  <span style="color: #483d8b;">@inline</span> Base.<span style="color: #0000ff;">getindex</span>(aa::<span style="color: #228b22;">AArray</span>{AT,N,P}, I::<span style="color: #228b22;">Vararg</span>{<span style="color: #228b22;">Int</span>, N}) <span style="color: #a020f0;">where</span> {AT,N,P} = AT(getindex(parent(aa),I...),getindex(aidx(aa),I...))
</pre>
</div>
<p>
which gives this:
</p>
<pre class="example">
ERROR: ArgumentError: invalid index: (1, 1)
Stacktrace:
[1] getindex(::Array{Float64,2}, ::Tuple{Int64,Int64}) at ./abstractarray.jl:883
</pre>

<p>
The correct form is:
</p>
<div class="org-src-container">
<pre class="src src-julia">  <span style="color: #483d8b;">@inline</span> Base.<span style="color: #0000ff;">getindex</span>(aa::<span style="color: #228b22;">AArray</span>{AT,N,P}, I::<span style="color: #228b22;">Vararg</span>{<span style="color: #228b22;">Int</span>, N}) <span style="color: #a020f0;">where</span> {AT,N,P} = AT(getindex(parent(aa),I...),getindex(aidx(aa),I...))
</pre>
</div>
</div>
</li>

<li><a id="org4379cdf"></a><span class="todo TODO">TODO</span> <code>[0/1]</code><br />
<div class="outline-text-5" id="text-4-1-3-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> implement:</li>
</ul>
<pre class="example">
function Base.similar(aa::AArray{T,N,P}, ::Type{TS}, dims::Dims) where {T,TS,N,P}
    return similar(parent(A), T, dims)
end
</pre>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org1bdd29b" class="outline-3">
<h3 id="org1bdd29b"><a id="ID-66703b8c-0f31-49db-bf41-268758ac27a9"></a><span class="section-number-3">4.2</span> Specialization of common functions</h3>
<div class="outline-text-3" id="text-4-2">
</div>

<div id="outline-container-orgc164f03" class="outline-4">
<h4 id="orgc164f03"><span class="section-number-4">4.2.1</span> <span class="todo TODO">TODO</span> Overloading ambiguity <code>[0/1]</code></h4>
<div class="outline-text-4" id="text-4-2-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> understand <b>exactly</b> why</li>
</ul>

<p>
I first wrote:
</p>
<div class="org-src-container">
<pre class="src src-julia">==(x1::<span style="color: #228b22;">AFloat</span>{T},x2::<span style="color: #228b22;">T</span>) <span style="color: #a020f0;">where</span> {T} = (x1.value == x2)
</pre>
</div>
<p>
but got:
</p>
<pre class="example">
  Expression: aa[2, 3] == a[2, 3]
  MethodError: ==(::PragmaticAD.AFloat{Float64}, ::Float64) is ambiguous. Candidates:
    ==(x1::PragmaticAD.AFloat{T}, x2::T) where T in PragmaticAD at /home/picaud/GitHub/PragmaticAD.jl/src/tape.jl:190
    ==(x::Number, y::Number) in Base at promotion.jl:290
  Possible fix, define
    ==(::PragmaticAD.AFloat{T&gt;:Number}, ::Number)
</pre>
<p>
The right way to do things seems to be:
</p>
<div class="org-src-container">
<pre class="src src-julia">==(x1::<span style="color: #228b22;">AFloat</span>{T},x2::<span style="color: #228b22;">Number</span>) <span style="color: #a020f0;">where</span> {T} = (x1.value == x2)
</pre>
</div>
</div>
</div>
