docs/docs.org
*** Code generator

Instead of:
 #+BEGIN_SRC julia :eval never 
import Base: (==)

==(x1::AFloat{T},x2::AFloat{T}) where {T} = (x1.value == x2.value)
==(x1::AFloat{T},x2::Number) where {T} = (x1.value == x2)
==(x1::Number,x2::AFloat{T}) where {T} = (x1 == x2.value)
 #+END_SRC

 a possible automation is:

 #+BEGIN_SRC julia :eval never 
for op = (:(==), :(<))
    @eval begin
        import Base: ($op)
        ($op)(x1::AFloat{T},x2::AFloat{T}) where {T} = ($op)(x1.value,x2.value)
        ($op)(x1::AFloat{T},x2::Number) where {T} = ($op)(x1.value,x2)
        ($op)(x1::Number,x2::AFloat{T}) where {T} = ($op)(x1,x2.value)
    end
end
 #+END_SRC

*CAVEAT*: 
Syntax, one must write
#+BEGIN_EXAMPLE
($op)(x1.value,x2)
#+END_EXAMPLE
and not
#+BEGIN_EXAMPLE
(x1.value $op x2)
#+END_EXAMPLE

* Unit tests

  #+BEGIN_SRC julia :results output table :exports results
include("/home/picaud/GitHub/PragmaticAD.jl/test/runtests.jl")
  #+END_SRC

  #+RESULTS:
  : Test Summary: | Pass  Total
  : PragmaticAD   |    2      2
